<div class="parent-table">
    <table>
        <thead>
        <tr>
            <th>الرقم الضريبي</th>
            <th>الاسم</th>
            <th>المهنة</th>
            <th>حالة الدفع</th>
            <th>حالة الإبلاغ</th>
            <th>حالة التحقق</th>
            <th>خيارات</th>
        </tr>
        </thead>
        <tbody>
        @foreach($assignment_persons as $assignment_person)

        <tr>
            <td>{{$assignment_person->tax_number}}</td>
            <td> {{$assignment_person->full_name}}  ابن  {{$assignment_person->father_name}} {{$assignment_person->mother_name}}   </td>
            <td>
                @foreach( $assignment_person->professions as $profession)
                    {{ $profession->occupation }}
                    @break

                @endforeach
                    @if(count($assignment_person->professions)>1)
                        {{',...'}}
                    @endif
                <span class="comp">
                    @if($assignment_person->type == 0)
                        {{'(شركة)'}}
                        @else
                        {{'(اعمال حرة)'}}
                    @endif

                </span>
                    <span class="multiple-os">
                        @if(count($assignment_person->professions)>1)
                            {{' (مهن متعددة)'}}
                        @endif
                       </span>
            </td>
            <td class="table-text-red">غير مدفوع</td>
            <td class="table-text-red">غير مبلغ</td>
            <td class="table-text-red">غير محقق</td>
            <td>
                <div class="table-actions"><a href="{{url('/assignment_persons/view/'.$assignment_person->id)}}">
                        <svg xmlns="http://www.w3.org/2000/svg" width="24.414" height="19.942" viewBox="0 0 24.414 19.942">
                            <path id="view" d="M11.7,6.052A3.483,3.483,0,1,1,9.232,7.073,3.483,3.483,0,0,1,11.7,6.052Zm10.08,8.575a.819.819,0,1,1,1.639,0v3.495a.821.821,0,0,1-.819.821h-4.9a.817.817,0,0,1,0-1.633h4.081V14.619ZM23.414,4.337a.819.819,0,1,1-1.639,0v-2.7H17.694a.817.817,0,0,1,0-1.633h4.9a.821.821,0,0,1,.819.819v3.5ZM1.639,4.323A.819.819,0,0,1,0,4.323V.819A.821.821,0,0,1,.819,0h4.9a.817.817,0,0,1,0,1.633H1.639V4.32ZM0,14.619a.819.819,0,1,1,1.639,0v2.687H5.716a.817.817,0,0,1,0,1.633H.819A.821.821,0,0,1,0,18.121ZM1.319,9.038A18.518,18.518,0,0,1,3.091,7.17a12.53,12.53,0,0,1,8.193-3.514,13.126,13.126,0,0,1,8.66,3.325A20.913,20.913,0,0,1,22.1,9.043a.705.705,0,0,1,.048.888,13.811,13.811,0,0,1-2.65,2.835,11.966,11.966,0,0,1-7.45,2.654,13.085,13.085,0,0,1-7.622-2.477A15.463,15.463,0,0,1,1.282,9.952a.7.7,0,0,1,.036-.915Zm2.717-.831a16.534,16.534,0,0,0-1.29,1.32A13.931,13.931,0,0,0,5.24,11.8a11.7,11.7,0,0,0,6.8,2.218,10.573,10.573,0,0,0,6.583-2.353,12.2,12.2,0,0,0,2.045-2.1,18.927,18.927,0,0,0-1.618-1.5,11.851,11.851,0,0,0-7.748-3A11.074,11.074,0,0,0,4.036,8.207Zm6.679-1.482A1.351,1.351,0,1,1,9.363,8.075a1.351,1.351,0,0,1,1.351-1.351Z" transform="translate(0.5 0.5)" stroke="#000" stroke-width="1" fill-rule="evenodd"/>
                        </svg></a>
                    <button>
                        <svg xmlns="http://www.w3.org/2000/svg" width="20.85" height="20.226" viewBox="0 0 20.85 20.226">
                            <path id="pen" d="M17.789.274l2.784,2.779a.947.947,0,0,1,0,1.337L19.033,5.938,14.91,1.815,16.459.274a.95.95,0,0,1,1.337,0ZM5.3.582h6.159l-2.79,2.79H5.3a2.5,2.5,0,0,0-1.775.735h0a2.5,2.5,0,0,0-.735,1.775v11.55H14.338a2.508,2.508,0,0,0,1.782-.73h0a2.508,2.508,0,0,0,.735-1.777v-2.15l2.79-2.79V14.92a5.3,5.3,0,0,1-1.558,3.745v.008a5.294,5.294,0,0,1-3.733,1.553H2.136a2.121,2.121,0,0,1-1.5-.623h0A2.123,2.123,0,0,1,0,18.1V5.879A5.286,5.286,0,0,1,1.558,2.146l.008-.008A5.289,5.289,0,0,1,5.3.583Zm6.969,12.11L8.925,13.727c-2.35.509-2.33,1.044-1.894-1.172L8.158,8.577h0L14.129,2.6l4.123,4.123L12.276,12.7h0ZM8.861,9.281,11.576,12l-2.206.679c-1.722.531-1.714.886-1.245-.772L8.861,9.29Z" transform="translate(0 0.001)" fill-rule="evenodd"/>
                        </svg>
                    </button>
                    <button>
                        <svg xmlns="http://www.w3.org/2000/svg" width="24.39" height="24.215" viewBox="0 0 24.39 24.215">
                            <path id="Delete" d="M15.148,15.419c-.821-.947-1.682-1.91-2.583-2.862a40.778,40.778,0,0,0-7.675,9.61c-2.43,4.415-6.017.8-4.39-2.4C1.808,16.85,5.172,12.8,9.215,9.286a33.354,33.354,0,0,0-7.34-5.1C-2.037,2.252.951-.989,3.781.3c2.384.944,5.673,3.375,8.682,6.4a26.74,26.74,0,0,1,9.025-4.567c.619-.146,2.427-.54,2.843.05.157.222-.016.556-.337.919-1.1,1.237-4.039,3.2-5.465,4.326-1.029.815-2.075,1.667-3.114,2.559a30.76,30.76,0,0,1,2.881,4.2,16.827,16.827,0,0,1,1.544,3.595c.15.53.56,2.079.066,2.461-.186.144-.482.008-.807-.256a48.3,48.3,0,0,1-3.95-4.562Z" transform="translate(0 -0.003)" fill="#eb0100" fill-rule="evenodd"/>
                        </svg>
                    </button>
                </div>
            </td>
        </tr>
        @endforeach
        </tbody>
    </table>
</div>
<div class="my-3 table-pagination ltr">
    <ul class="d-flex align-itens-center">
        {{$assignment_persons->links()}}
{{--        <li> <a href="#">1</a></li>--}}
{{--        <li> <a href="#">2</a></li>--}}
{{--        <li> <a href="#">3</a></li>--}}
{{--        <li> <a href="#">4</a></li>--}}
{{--        <li> <a href="#">5</a></li>--}}
    </ul>
</div>